tutorials/bladeMachines/extend-4.0/AxialStageMRFRotating/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 170);

boundaryField
{
    inlet_0
    {
        type            temperatureDirectedInletOutletVelocity;
        inletDirection  uniform ( 0 0 1 );
        phi             phi;
        T               T;
        T0              uniform 293;
        cylindricalCCS  no;
        omega           ( 0 0 0 );
        value           uniform (0 0 210);
    }
    outlet_0
    {
        type            overlapGgi;
    }
    passageSidesUpper_0
    {
        type            cyclicGgi;
    }
    passageSidesLower_0
    {
        type            cyclicGgi;
    }
    hub_0
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    shroud_0
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    blade_0
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    inlet_1
    {
        type            overlapGgi;
    }

    outlet_1
    {
        type            zeroGradient;
    }

    passageSidesUpper_1
    {
        type            cyclicGgi;
    }

    passageSidesLower_1
    {
        type            cyclicGgi;
    }

    hub_1
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    shroud_1
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    blade_1
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}

// ************************************************************************* //
