tutorials/bladeMachines/extend-4.0/AxialStageMRFRotating/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 95000.0;

boundaryField
{
    inlet_0
    {
        type            zeroGradient;
    }

    outlet_0
    {
        type            overlapGgi;
    }

    passageSidesUpper_0
    {
        type            cyclicGgi;
    }

    passageSidesLower_0
    {
        type            cyclicGgi;
    }

    hub_0
    {
        type            zeroGradient;
    }

    shroud_0
    {
        type            zeroGradient;
    }

    blade_0
    {
        type            zeroGradient;
    }

    inlet_1
    {
        type            overlapGgi;
    }

    outlet_1
    {
        type            fixedValue;
        value           uniform 101300.0;
    }

    passageSidesUpper_1
    {
        type            cyclicGgi;
    }

    passageSidesLower_1
    {
        type            cyclicGgi;
    }

    hub_1
    {
        type            zeroGradient;
    }

    shroud_1
    {
        type            zeroGradient;
    }

    blade_1
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
